---
kind: type
id: T:Autodesk.Revit.DB.TextAlignMask
source: html/16629583-3496-1617-f384-5ce49ce93134.htm
---
# Autodesk.Revit.DB.TextAlignMask

An enumerated type listing all the Text align mask.

## Syntax (C#)
```csharp
public enum TextAlignMask
```